[
  {
    "id": 1,
    "text": "What is your best kept intimate secret?"
  },
  {
    "id": 2,
    "text": "What did you think of me when you first met me?"
  },
  {
    "id": 3,
    "text": "What’s your favourite sex position?"
  },
  {
    "id": 4,
    "text": "What is one of your fantasies?"
  },
  {
    "id": 5,
    "text": "Where do you love to have sex?"
  },
  {
    "id": 6,
    "text": "Do you still have feelings for an ex?"
  },
  {
    "id": 7,
    "text": "Do you love quickies?"
  },
  {
    "id": 8,
    "text": "How do you visualize the perfect woman? What are her attributes?"
  },
  {
    "id": 9,
    "text": "What would be your best reason to break up with me?"
  },
  {
    "id": 10,
    "text": "How would you react if the doctor told me that I have a deadly disease? Would you still love me?"
  },
  {
    "id": 11,
    "text": "If I had to move far away for many years, would you wait for me?"
  },
  {
    "id": 12,
    "text": "What do you like the most that I do when we have sex?"
  },
  {
    "id": 13,
    "text": "What lingerie would you love to see a girl in?"
  },
  {
    "id": 14,
    "text": "How many girls have you slept with?"
  },
  {
    "id": 15,
    "text": "Where is the strangest place you’ve ever had sex?"
  },
  {
    "id": 16,
    "text": "Who was your first girlfriend?"
  },
  {
    "id": 17,
    "text": "How would you react if I was dating another guy?"
  },
  {
    "id": 18,
    "text": "At what age do you plan to get married?"
  },
  {
    "id": 19,
    "text": "What is it that you don’t like about me?"
  },
  {
    "id": 20,
    "text": "If you had the opportunity, which of my friends would you have sex with?"
  },
  {
    "id": 21,
    "text": "What turns you on most during sex?"
  },
  {
    "id": 22,
    "text": "Do you see me in your future?"
  },
  {
    "id": 23,
    "text": "What was your first kiss like?"
  },
  {
    "id": 24,
    "text": "Do you like using props in the bedroom?"
  },
  {
    "id": 25,
    "text": "What’s the ultimate role play for you?"
  },
  {
    "id": 26,
    "text": "Who is your favorite porn star?"
  },
  {
    "id": 27,
    "text": "Are you a jealous person?"
  },
  {
    "id": 28,
    "text": "How many times have you been in love?"
  },
  {
    "id": 29,
    "text": "Who are your ex-girlfriends, (if any) and what made the relationship end as it did?"
  },
  {
    "id": 30,
    "text": "what have you learned from life that makes you who you are today?"
  },
  {
    "id": 31,
    "text": "What are your plans (goals) for the future?"
  },
  {
    "id": 32,
    "text": "If I had an accident and be left with terrible scars for life, would you still love me?"
  },
  {
    "id": 33,
    "text": "What is it of me that you like the most?"
  },
  {
    "id": 34,
    "text": "How do you remember your “first love”?"
  },
  {
    "id": 35,
    "text": "After me, who is your closest female friend? (excluding your mother, and other family members)"
  },
  {
    "id": 36,
    "text": "How do you remember my first impression?"
  },
  {
    "id": 37,
    "text": "Would you leave me for a celebrity that really liked you?"
  },
  {
    "id": 38,
    "text": "Are you a virgin?"
  },
  {
    "id": 39,
    "text": "Do you think it’s OK for me to still have feelings for an ex?"
  },
  {
    "id": 40,
    "text": "Do you like to have children one day?"
  },
  {
    "id": 41,
    "text": "What would you change about me if you could?"
  },
  {
    "id": 42,
    "text": "Do you regret going out with me?"
  },
  {
    "id": 43,
    "text": "What would you do if your best friend told you I was a bad influence?"
  },
  {
    "id": 44,
    "text": "Have you ever lied to me?"
  },
  {
    "id": 45,
    "text": "Would you sleep with another girl, if I was out of the country, and the opportunity presented itself?"
  },
  {
    "id": 46,
    "text": "Have you ever slapped a girl?"
  },
  {
    "id": 47,
    "text": "If we had a child born with health problems, how would you handle the situation?"
  },
  {
    "id": 48,
    "text": "What are your financial goals for the future?"
  },
  {
    "id": 49,
    "text": "How and when would you know if I am the right one?"
  },
  {
    "id": 50,
    "text": "Do you believe in God? Why?"
  },
  {
    "id": 51,
    "text": "Have you ever had the feeling you were being watched??"
  },
  {
    "id": 52,
    "text": "Have you ever sexually abused another girl?"
  },
  {
    "id": 53,
    "text": "What is the craziest thing you’ve ever done?"
  },
  {
    "id": 54,
    "text": "What is the craziest thing you’ve ever done?"
  },
  {
    "id": 55,
    "text": "So, what’s your thought on evolution?"
  },
  {
    "id": 56,
    "text": "What would you do if you were the last person on this earth?"
  },
  {
    "id": 58,
    "text": "Who has been your most intimate partner?"
  },
  {
    "id": 59,
    "text": "Do you still have feelings for an ex-intimate partner?"
  },
  {
    "id": 60,
    "text": "How long did your most intimate relationship last?"
  },
  {
    "id": 61,
    "text": "Do you regret living those intimate experiences with that person?"
  },
  {
    "id": 63,
    "text": "Are you a virgin?"
  },
  {
    "id": 64,
    "text": "Do you rather follow your heart (that does not think) or your head (that does think)?"
  },
  {
    "id": 65,
    "text": "What do you think is better: premarital sex or premarital abstinence?"
  },
  {
    "id": 66,
    "text": "Do you think the past matters in a relationship?"
  },
  {
    "id": 67,
    "text": "How would you react if I had a more serious intimate relationship in the past?"
  },
  {
    "id": 68,
    "text": "Have you ever committed a crime?"
  },
  {
    "id": 69,
    "text": "Are you into kinky sex?"
  },
  {
    "id": 70,
    "text": "What are your views about my mother, father or any member of my family?"
  },
  {
    "id": 71,
    "text": "Do you believe in love at first sight?"
  },
  {
    "id": 72,
    "text": "Do you like my friends?"
  },
  {
    "id": 73,
    "text": "What would you do if I told you I cannot stand the sight of your friend?"
  },
  {
    "id": 74,
    "text": "Why did you break up with your first girlfriend?"
  },
  {
    "id": 75,
    "text": "How old were you when you first had sex?"
  },
  {
    "id": 76,
    "text": "What would be the best reason to break off our relationship?"
  },
  {
    "id": 78,
    "text": "If I had an accident and was paralysed, would you still love me?"
  },
  {
    "id": 79,
    "text": "Would you forgive me if I slept with someone and regretted it?"
  },
  {
    "id": 80,
    "text": "What are you ashamed of?"
  },
  {
    "id": 81,
    "text": "What is your definition of intimate"
  },
  {
    "id": 82,
    "text": "What are your future financial plans?"
  },
  {
    "id": 83,
    "text": "What is your major goal in life?"
  },
  {
    "id": 84,
    "text": "What is your favourite book?"
  },
  {
    "id": 85,
    "text": "How would you describe yourself in 3 words?"
  },
  {
    "id": 86,
    "text": "What are your major flaws?"
  },
  {
    "id": 87,
    "text": "Who is your hero?"
  },
  {
    "id": 88,
    "text": "What do you consider most important in life?"
  },
  {
    "id": 89,
    "text": "What would be your questions to ask on a first date?"
  },
  {
    "id": 90,
    "text": "Do have any type of bad habit?"
  },
  {
    "id": 91,
    "text": "What is your definition of intimate?"
  },
  {
    "id": 92,
    "text": "Would you rather follow your heart or your head?"
  },
  {
    "id": 93,
    "text": "Are you addicted to porn?"
  },
  {
    "id": 94,
    "text": "If we ever got married and had a child with a deformity, how would you handle it?"
  },
  {
    "id": 95,
    "text": "How would you define a good sexual relationship?"
  },
  {
    "id": 96,
    "text": "What’s your idea of foreplay?"
  },
  {
    "id": 97,
    "text": "If you had the opportunity which celebrity would you sleep with? Why?"
  },
  {
    "id": 98,
    "text": "Do you have any sexually transmitted diseases?"
  },
  {
    "id": 99,
    "text": "What do I do wrong when we have sex?"
  },
  {
    "id": 100,
    "text": "Have you ever thought about ending our relationship?"
  }
]
